import keyboard

# Словарь для перевода символов с английской раскладки на русскую и наоборот
layout = {
    'q': 'й', 'w': 'ц', 'e': 'у', 'r': 'к', 't': 'е', 'y': 'н', 'u': 'г', 'i': 'ш', 'o': 'щ', 'p': 'з', '[': 'х', ']': 'ъ',
    'a': 'ф', 's': 'ы', 'd': 'в', 'f': 'а', 'g': 'п', 'h': 'р', 'j': 'о', 'k': 'л', 'l': 'д', ';': 'ж', "'": 'э', 
    'z': 'я', 'x': 'ч', 'c': 'с', 'v': 'м', 'b': 'и', 'n': 'т', 'm': 'ь', ',': 'б', '.': 'ю', '/': '.',
    'й': 'q', 'ц': 'w', 'у': 'e', 'к': 'r', 'е': 't', 'н': 'y', 'г': 'u', 'ш': 'i', 'щ': 'o', 'з': 'p', 'х': '[', 'ъ': ']',
    'ф': 'a', 'ы': 's', 'в': 'd', 'а': 'f', 'п': 'g', 'р': 'h', 'о': 'j', 'л': 'k', 'д': 'l', 'ж': ';', 'э': "'",
    'я': 'z', 'ч': 'x', 'с': 'c', 'м': 'v', 'и': 'b', 'т': 'n', 'ь': 'm', 'б': ',', 'ю': '.', '.': '/'
}

# Флаг для отслеживания текущей раскладки
current_layout = 'en'

def switch_layout():
    global current_layout
    current_layout = 'ru' if current_layout == 'en' else 'en'

# Функция для обработки нажатия клавиши
def on_key_press(event):
    if event.name == 'insert':
        switch_layout()
        keyboard.send('alt+shift')  # комбинация клавиш для смены раскладки

# Регистрация обработчика событий клавиатуры
keyboard.on_press(on_key_press)

# Запуск обработчика
keyboard.wait('esc')  # Ждем нажатия клавиши Esc для завершения программы
